---
kind: method
id: M:Autodesk.Revit.DB.GeometryElement.GetEnumeratorNG
source: html/f2bb4cd3-999b-9ffc-3327-59d8e01049cc.htm
---
# Autodesk.Revit.DB.GeometryElement.GetEnumeratorNG Method

Returns an enumerator that iterates through the collection.

## Syntax (C#)
```csharp
internal IEnumerator GetEnumeratorNG()
```

## Returns
An IEnumerator(GeometryObject) object that can be used to iterate through the collection.